notebook/rlx-todo.org
* TODO BOSTON LISP CONFERENCE PREP
** DONE tracing macros
CLOSED: [2009-01-11 Sun 17:48]
** TODO struct-pool allocator thing
*** DONE common data structure for reusing slots. (each slot is a pair of bool, any-datum
CLOSED: [2009-01-12 Mon 06:48]
*** DONE request initial allocation and growth rate
CLOSED: [2009-01-12 Mon 06:48]
*** TODO reread pool.lisp
*** TODO Test pool structure
** TODO reread math.lisp
*** TODO point data structure for certain tasks
** TODO port plasma stuff
** TODO port pathfinding
** TODO port crater / mars generation stuff

* TODO ALPHA RELEASE
** TODO RLX dev manual, document the API
** TODO temporary dialog widget allows numeric input
** TODO improve equipment/firing controls/menu system
*** TODO enter menu with tab
*** TODO hierarchical menus
*** TODO select option or menu with space
*** TODO define faces
** DONE fix crash when shield pops up off map edge
CLOSED: [2008-12-31 Wed 16:58]
** TODO fix render-formatted-line warning error null string thing bug 
** TODO implement 3 new gameplay ideas
*** TODO oxygen death
*** TODO environment suit uses energy every turn to resist cold
*** TODO dangerous firing rook!
** TODO parameterized levels with colors
** TODO metaworld for installation 774
** TODO implement drop-cell with no-collisions
** TODO find equipment in remodeled green crates
** TODO fix monsters attacking non-targets
** TODO <actions> should be a plist of :key -> AP cost
** TODO remappable per-module command input symbols
** TODO change narration excluded keywords to INcluded
** TODO per-module post load hook (for remapping keys etc)
** TODO better maze walls
** TODO oxygen death
** TODO loadout by default?
** TODO Review codebase
** TODO port pathfinding code
** TODO define browser keys (instead of queueing to :browser)
** TODO fix lighting artifacts (light all possible destination squares within radius)
** TODO Fix monsters jumping on me
** TODO container sorting
** TODO Refactor browser line render strategy for :equipment and :inventory modes
** TODO Action menu browser
** TODO browser item inspection
** TODO Browser history
** TODO fix equipment plist weirdness
** TODO [#C] improve radio.el
** TODO [#C] improve CLON object printing/inspection
** TODO [#A] examine current square
** TODO [#B] monster generators, speed determined by game level
** TODO [#B] infinite levels, color changes, you can't win!
** TODO [#C] support colored border around formatters
** TODO [#C] support titled formatters
** TODO map overlays 
** TODO targeting reticle
