notebook/rlx-todo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>rlx-todo</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-01 20:23:00 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">rlx-todo</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="todo TODO"> TODO</span> BOSTON LISP CONFERENCE PREP </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="done DONE"> DONE</span> tracing macros </h3>
<div class="outline-text-3" id="text-1-1">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2009-01-11 Sun 17:48</span></span><br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="todo TODO"> TODO</span> struct-pool allocator thing </h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="done DONE"> DONE</span> common data structure for reusing slots. (each slot is a pair of bool, any-datum </h4>
<div class="outline-text-4" id="text-1-2-1">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2009-01-12 Mon 06:48</span></span><br/>
</p></div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="done DONE"> DONE</span> request initial allocation and growth rate </h4>
<div class="outline-text-4" id="text-1-2-2">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2009-01-12 Mon 06:48</span></span><br/>
</p></div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="todo TODO"> TODO</span> reread pool.lisp </h4>
<div class="outline-text-4" id="text-1-2-3">

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="todo TODO"> TODO</span> Test pool structure </h4>
<div class="outline-text-4" id="text-1-2-4">

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="todo TODO"> TODO</span> reread math.lisp </h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="todo TODO"> TODO</span> point data structure for certain tasks </h4>
<div class="outline-text-4" id="text-1-3-1">

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="todo TODO"> TODO</span> port plasma stuff </h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="todo TODO"> TODO</span> port pathfinding </h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="todo TODO"> TODO</span> port crater / mars generation stuff </h3>
<div class="outline-text-3" id="text-1-6">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="todo TODO"> TODO</span> ALPHA RELEASE </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="todo TODO"> TODO</span> RLX dev manual, document the API </h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="todo TODO"> TODO</span> temporary dialog widget allows numeric input </h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="todo TODO"> TODO</span> improve equipment/firing controls/menu system </h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="todo TODO"> TODO</span> enter menu with tab </h4>
<div class="outline-text-4" id="text-2-3-1">

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="todo TODO"> TODO</span> hierarchical menus </h4>
<div class="outline-text-4" id="text-2-3-2">

</div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="todo TODO"> TODO</span> select option or menu with space </h4>
<div class="outline-text-4" id="text-2-3-3">

</div>

</div>

<div id="outline-container-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="todo TODO"> TODO</span> define faces </h4>
<div class="outline-text-4" id="text-2-3-4">

</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="done DONE"> DONE</span> fix crash when shield pops up off map edge </h3>
<div class="outline-text-3" id="text-2-4">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2008-12-31 Wed 16:58</span></span><br/>
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="todo TODO"> TODO</span> fix render-formatted-line warning error null string thing bug </h3>
<div class="outline-text-3" id="text-2-5">

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="todo TODO"> TODO</span> implement 3 new gameplay ideas </h3>
<div class="outline-text-3" id="text-2-6">


</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="todo TODO"> TODO</span> oxygen death </h4>
<div class="outline-text-4" id="text-2-6-1">

</div>

</div>

<div id="outline-container-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="todo TODO"> TODO</span> environment suit uses energy every turn to resist cold </h4>
<div class="outline-text-4" id="text-2-6-2">

</div>

</div>

<div id="outline-container-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="todo TODO"> TODO</span> dangerous firing rook! </h4>
<div class="outline-text-4" id="text-2-6-3">

</div>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="todo TODO"> TODO</span> parameterized levels with colors </h3>
<div class="outline-text-3" id="text-2-7">

</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="todo TODO"> TODO</span> metaworld for installation 774 </h3>
<div class="outline-text-3" id="text-2-8">

</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="todo TODO"> TODO</span> implement drop-cell with no-collisions </h3>
<div class="outline-text-3" id="text-2-9">

</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="todo TODO"> TODO</span> find equipment in remodeled green crates </h3>
<div class="outline-text-3" id="text-2-10">

</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="todo TODO"> TODO</span> fix monsters attacking non-targets </h3>
<div class="outline-text-3" id="text-2-11">

</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="todo TODO"> TODO</span> &lt;actions&gt; should be a plist of :key -&gt; AP cost </h3>
<div class="outline-text-3" id="text-2-12">

</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="todo TODO"> TODO</span> remappable per-module command input symbols </h3>
<div class="outline-text-3" id="text-2-13">

</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="todo TODO"> TODO</span> change narration excluded keywords to INcluded </h3>
<div class="outline-text-3" id="text-2-14">

</div>

</div>

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="todo TODO"> TODO</span> per-module post load hook (for remapping keys etc) </h3>
<div class="outline-text-3" id="text-2-15">

</div>

</div>

<div id="outline-container-2-16" class="outline-3">
<h3 id="sec-2-16"><span class="todo TODO"> TODO</span> better maze walls </h3>
<div class="outline-text-3" id="text-2-16">

</div>

</div>

<div id="outline-container-2-17" class="outline-3">
<h3 id="sec-2-17"><span class="todo TODO"> TODO</span> oxygen death </h3>
<div class="outline-text-3" id="text-2-17">

</div>

</div>

<div id="outline-container-2-18" class="outline-3">
<h3 id="sec-2-18"><span class="todo TODO"> TODO</span> loadout by default? </h3>
<div class="outline-text-3" id="text-2-18">

</div>

</div>

<div id="outline-container-2-19" class="outline-3">
<h3 id="sec-2-19"><span class="todo TODO"> TODO</span> Review codebase </h3>
<div class="outline-text-3" id="text-2-19">

</div>

</div>

<div id="outline-container-2-20" class="outline-3">
<h3 id="sec-2-20"><span class="todo TODO"> TODO</span> port pathfinding code </h3>
<div class="outline-text-3" id="text-2-20">

</div>

</div>

<div id="outline-container-2-21" class="outline-3">
<h3 id="sec-2-21"><span class="todo TODO"> TODO</span> define browser keys (instead of queueing to :browser) </h3>
<div class="outline-text-3" id="text-2-21">

</div>

</div>

<div id="outline-container-2-22" class="outline-3">
<h3 id="sec-2-22"><span class="todo TODO"> TODO</span> fix lighting artifacts (light all possible destination squares within radius) </h3>
<div class="outline-text-3" id="text-2-22">

</div>

</div>

<div id="outline-container-2-23" class="outline-3">
<h3 id="sec-2-23"><span class="todo TODO"> TODO</span> Fix monsters jumping on me </h3>
<div class="outline-text-3" id="text-2-23">

</div>

</div>

<div id="outline-container-2-24" class="outline-3">
<h3 id="sec-2-24"><span class="todo TODO"> TODO</span> container sorting </h3>
<div class="outline-text-3" id="text-2-24">

</div>

</div>

<div id="outline-container-2-25" class="outline-3">
<h3 id="sec-2-25"><span class="todo TODO"> TODO</span> Refactor browser line render strategy for :equipment and :inventory modes </h3>
<div class="outline-text-3" id="text-2-25">

</div>

</div>

<div id="outline-container-2-26" class="outline-3">
<h3 id="sec-2-26"><span class="todo TODO"> TODO</span> Action menu browser </h3>
<div class="outline-text-3" id="text-2-26">

</div>

</div>

<div id="outline-container-2-27" class="outline-3">
<h3 id="sec-2-27"><span class="todo TODO"> TODO</span> browser item inspection </h3>
<div class="outline-text-3" id="text-2-27">

</div>

</div>

<div id="outline-container-2-28" class="outline-3">
<h3 id="sec-2-28"><span class="todo TODO"> TODO</span> Browser history </h3>
<div class="outline-text-3" id="text-2-28">

</div>

</div>

<div id="outline-container-2-29" class="outline-3">
<h3 id="sec-2-29"><span class="todo TODO"> TODO</span> fix equipment plist weirdness </h3>
<div class="outline-text-3" id="text-2-29">

</div>

</div>

<div id="outline-container-2-30" class="outline-3">
<h3 id="sec-2-30"><span class="todo TODO"> TODO</span> improve radio.el </h3>
<div class="outline-text-3" id="text-2-30">

</div>

</div>

<div id="outline-container-2-31" class="outline-3">
<h3 id="sec-2-31"><span class="todo TODO"> TODO</span> improve CLON object printing/inspection </h3>
<div class="outline-text-3" id="text-2-31">

</div>

</div>

<div id="outline-container-2-32" class="outline-3">
<h3 id="sec-2-32"><span class="todo TODO"> TODO</span> examine current square </h3>
<div class="outline-text-3" id="text-2-32">

</div>

</div>

<div id="outline-container-2-33" class="outline-3">
<h3 id="sec-2-33"><span class="todo TODO"> TODO</span> monster generators, speed determined by game level </h3>
<div class="outline-text-3" id="text-2-33">

</div>

</div>

<div id="outline-container-2-34" class="outline-3">
<h3 id="sec-2-34"><span class="todo TODO"> TODO</span> infinite levels, color changes, you can't win! </h3>
<div class="outline-text-3" id="text-2-34">

</div>

</div>

<div id="outline-container-2-35" class="outline-3">
<h3 id="sec-2-35"><span class="todo TODO"> TODO</span> support colored border around formatters </h3>
<div class="outline-text-3" id="text-2-35">

</div>

</div>

<div id="outline-container-2-36" class="outline-3">
<h3 id="sec-2-36"><span class="todo TODO"> TODO</span> support titled formatters </h3>
<div class="outline-text-3" id="text-2-36">

</div>

</div>

<div id="outline-container-2-37" class="outline-3">
<h3 id="sec-2-37"><span class="todo TODO"> TODO</span> map overlays </h3>
<div class="outline-text-3" id="text-2-37">

</div>

</div>

<div id="outline-container-2-38" class="outline-3">
<h3 id="sec-2-38"><span class="todo TODO"> TODO</span> targeting reticle </h3>
<div class="outline-text-3" id="text-2-38">

</div>

</div>
