notebook/rlx-todo.org
** TODO select a square
** TODO pathfinding white graviceptor 
** TODO design overview in rlx.lisp
** TODO [#C] prompt arrow keybindings
** TODO check weight on container add
** TODO store container-parent link
** TODO [#C] add console-style menus to output widget? probably simpler...
** TODO [#C]  elisp for auto-updating PAK files to grab new images in dirs
** TODO [#C] change index.pak to vm0.pak
** TODO [#B] get rid of eon slot descriptor specs?
** TODO :controller events for dvorak/svorak fun

* OLD TASKS, IGNORE THIS
** TODO http://roguelikedeveloper.blogspot.com/\
** TODO http://www.squidi.net/three/index.php
** TODO Establish RLX mailing list
** TODO Implement metaworld planet generator / serialization manager
*** TODO Implement plasma planet map and "metatiles"
*** TODO Template for world generation/deserialization function
*** TODO Serialization
** TODO Implement all ops, including :erase
** TODO Add new grid operations for world building
* Void Mission Tasks
** TODO Create laptop keymap alternatives
** TODO Complete Outpost
*** TODO "Described" command allows object to give knowledge
*** TODO Allow equipping both handst
**** TODO [ and ] to choose attacking hand, other hand is Using hand
*** TODO Make lanterns and batteries work properly
**** TODO Properly compute items in containers
**** TODO Battery should receive turns while contained. 
*** TODO Revise outpost rendering routine
** TODO Update HUD when contained object is destroyed
*** TODO Use some kind of Observer pattern?
** TODO Fix picking up more than one item, doesn't work...
** TODO Implement :replace-top in editor
** --------------------------------------------------------
** TODO Implement overworld map and generation of wilderness regions
** TODO Implement :created action for cells when cloned
** TODO Refine combat model and formulas
** TODO Implement more sophisticated attack system with hit/miss/dodge
** DONE [#C] Bugfix: max-appearances not being honored in metamap generator
   CLOSED: [2006-10-04 Wed 06:16]
** TODO [#B] Implement item collections that aggregate, via :quantity property
** TODO [#C] Implement slave AI players who cluster around and defend player
* Artificial Intellgence
** TODO FSM framework built into RLX? 
- http://en.wikipedia.org/wiki/Finite_state_machine
- http://www-ccrma.stanford.edu/~cburns/220b/probmachine.lisp
- http://www.mail-archive.com/gnu-emacs-sources@gnu.org/msg00308/fsm.el

** TODO Implement better wandering where wander direction is related to last
** TODO Implement LOS-based simple seeking with latency
** TODO Make enemies that only wake up on LOS / nearness
** TODO Behaviors
 - stop stay flee retreat explore wander search
 - spy patrol defend guard attack surround shun avoid 
 - follow group work
 - use a stack so that it can go back to what it was doing
 - allow to alter cost function to penalize light areas, for hiding, etc
* Enhancements and fixes 
** TODO Add colors to status display
** TODO Allow property sheet editor to edit multiple cells on a grid
** TODO red asterisks, allow to edit text lambdas in editor
** TODO Come up with better scheme for spraying fractal terrain.
** TODO Metamap: Allow really low and really high / required probability maps
** TODO Use horizontal space in narration window to summarize encounter. 
