notebook/rlx-todo.html

<div id="outline-container-2-39" class="outline-3">
<h3 id="sec-2-39"><span class="todo TODO"> TODO</span> select a square </h3>
<div class="outline-text-3" id="text-2-39">

</div>

</div>

<div id="outline-container-2-40" class="outline-3">
<h3 id="sec-2-40"><span class="todo TODO"> TODO</span> pathfinding white graviceptor </h3>
<div class="outline-text-3" id="text-2-40">

</div>

</div>

<div id="outline-container-2-41" class="outline-3">
<h3 id="sec-2-41"><span class="todo TODO"> TODO</span> design overview in rlx.lisp </h3>
<div class="outline-text-3" id="text-2-41">

</div>

</div>

<div id="outline-container-2-42" class="outline-3">
<h3 id="sec-2-42"><span class="todo TODO"> TODO</span> prompt arrow keybindings </h3>
<div class="outline-text-3" id="text-2-42">

</div>

</div>

<div id="outline-container-2-43" class="outline-3">
<h3 id="sec-2-43"><span class="todo TODO"> TODO</span> check weight on container add </h3>
<div class="outline-text-3" id="text-2-43">

</div>

</div>

<div id="outline-container-2-44" class="outline-3">
<h3 id="sec-2-44"><span class="todo TODO"> TODO</span> store container-parent link </h3>
<div class="outline-text-3" id="text-2-44">

</div>

</div>

<div id="outline-container-2-45" class="outline-3">
<h3 id="sec-2-45"><span class="todo TODO"> TODO</span> add console-style menus to output widget? probably simpler&hellip; </h3>
<div class="outline-text-3" id="text-2-45">

</div>

</div>

<div id="outline-container-2-46" class="outline-3">
<h3 id="sec-2-46"><span class="todo TODO"> TODO</span> elisp for auto-updating PAK files to grab new images in dirs </h3>
<div class="outline-text-3" id="text-2-46">

</div>

</div>

<div id="outline-container-2-47" class="outline-3">
<h3 id="sec-2-47"><span class="todo TODO"> TODO</span> change index.pak to vm0.pak </h3>
<div class="outline-text-3" id="text-2-47">

</div>

</div>

<div id="outline-container-2-48" class="outline-3">
<h3 id="sec-2-48"><span class="todo TODO"> TODO</span> get rid of eon slot descriptor specs? </h3>
<div class="outline-text-3" id="text-2-48">

</div>

</div>

<div id="outline-container-2-49" class="outline-3">
<h3 id="sec-2-49"><span class="todo TODO"> TODO</span> :controller events for dvorak/svorak fun </h3>
<div class="outline-text-3" id="text-2-49">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">OLD TASKS, IGNORE THIS </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="todo TODO"> TODO</span> <a href="http://roguelikedeveloper.blogspot.com/">http://roguelikedeveloper.blogspot.com/</a>\ </h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="todo TODO"> TODO</span> <a href="http://www.squidi.net/three/index.php">http://www.squidi.net/three/index.php</a> </h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="todo TODO"> TODO</span> Establish RLX mailing list </h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="todo TODO"> TODO</span> Implement metaworld planet generator / serialization manager </h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="todo TODO"> TODO</span> Implement plasma planet map and "metatiles" </h4>
<div class="outline-text-4" id="text-3-4-1">

</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="todo TODO"> TODO</span> Template for world generation/deserialization function </h4>
<div class="outline-text-4" id="text-3-4-2">

</div>

</div>

<div id="outline-container-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="todo TODO"> TODO</span> Serialization </h4>
<div class="outline-text-4" id="text-3-4-3">

</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="todo TODO"> TODO</span> Implement all ops, including :erase </h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="todo TODO"> TODO</span> Add new grid operations for world building </h3>
<div class="outline-text-3" id="text-3-6">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Void Mission Tasks </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="todo TODO"> TODO</span> Create laptop keymap alternatives </h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="todo TODO"> TODO</span> Complete Outpost </h3>
<div class="outline-text-3" id="text-4-2">


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="todo TODO"> TODO</span> "Described" command allows object to give knowledge </h4>
<div class="outline-text-4" id="text-4-2-1">

</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="todo TODO"> TODO</span> Allow equipping both handst </h4>
<div class="outline-text-4" id="text-4-2-2">

<ul>
<li id="sec-4-2-2-1"><span class="todo TODO"> TODO</span> [ and ] to choose attacking hand, other hand is Using hand <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="todo TODO"> TODO</span> Make lanterns and batteries work properly </h4>
<div class="outline-text-4" id="text-4-2-3">

<ul>
<li id="sec-4-2-3-1"><span class="todo TODO"> TODO</span> Properly compute items in containers <br/>
</li>
</ul>
<ul>
<li id="sec-4-2-3-2"><span class="todo TODO"> TODO</span> Battery should receive turns while contained. <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="todo TODO"> TODO</span> Revise outpost rendering routine </h4>
<div class="outline-text-4" id="text-4-2-4">

</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="todo TODO"> TODO</span> Update HUD when contained object is destroyed </h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="todo TODO"> TODO</span> Use some kind of Observer pattern? </h4>
<div class="outline-text-4" id="text-4-3-1">

</div>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="todo TODO"> TODO</span> Fix picking up more than one item, doesn't work&hellip; </h3>
<div class="outline-text-3" id="text-4-4">

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="todo TODO"> TODO</span> Implement :replace-top in editor </h3>
<div class="outline-text-3" id="text-4-5">

</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6">&ndash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash; </h3>
<div class="outline-text-3" id="text-4-6">

</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="todo TODO"> TODO</span> Implement overworld map and generation of wilderness regions </h3>
<div class="outline-text-3" id="text-4-7">

</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="todo TODO"> TODO</span> Implement :created action for cells when cloned </h3>
<div class="outline-text-3" id="text-4-8">

</div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="todo TODO"> TODO</span> Refine combat model and formulas </h3>
<div class="outline-text-3" id="text-4-9">

</div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="todo TODO"> TODO</span> Implement more sophisticated attack system with hit/miss/dodge </h3>
<div class="outline-text-3" id="text-4-10">

</div>

</div>

<div id="outline-container-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="done DONE"> DONE</span> Bugfix: max-appearances not being honored in metamap generator </h3>
<div class="outline-text-3" id="text-4-11">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-10-04 Wed 06:16</span></span><br/>
</p></div>

</div>

<div id="outline-container-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="todo TODO"> TODO</span> Implement item collections that aggregate, via :quantity property </h3>
<div class="outline-text-3" id="text-4-12">

</div>

</div>

<div id="outline-container-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="todo TODO"> TODO</span> Implement slave AI players who cluster around and defend player </h3>
<div class="outline-text-3" id="text-4-13">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Artificial Intellgence </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="todo TODO"> TODO</span> FSM framework built into RLX? </h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li><a href="http://en.wikipedia.org/wiki/Finite_state_machine">http://en.wikipedia.org/wiki/Finite_state_machine</a>
</li>
<li><a href="http://www-ccrma.stanford.edu/~cburns/220b/probmachine.lisp">http://www-ccrma.stanford.edu/~cburns/220b/probmachine.lisp</a>
</li>
<li><a href="http://www.mail-archive.com/gnu-emacs-sources@gnu.org/msg00308/fsm.el">http://www.mail-archive.com/gnu-emacs-sources@gnu.org/msg00308/fsm.el</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="todo TODO"> TODO</span> Implement better wandering where wander direction is related to last </h3>
<div class="outline-text-3" id="text-5-2">

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="todo TODO"> TODO</span> Implement LOS-based simple seeking with latency </h3>
<div class="outline-text-3" id="text-5-3">

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="todo TODO"> TODO</span> Make enemies that only wake up on LOS / nearness </h3>
<div class="outline-text-3" id="text-5-4">

</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="todo TODO"> TODO</span> Behaviors </h3>
<div class="outline-text-3" id="text-5-5">

<ul>
<li>stop stay flee retreat explore wander search
</li>
<li>spy patrol defend guard attack surround shun avoid 
</li>
<li>follow group work
</li>
<li>use a stack so that it can go back to what it was doing
</li>
<li>allow to alter cost function to penalize light areas, for hiding, etc
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Enhancements and fixes </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="todo TODO"> TODO</span> Add colors to status display </h3>
<div class="outline-text-3" id="text-6-1">

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="todo TODO"> TODO</span> Allow property sheet editor to edit multiple cells on a grid </h3>
<div class="outline-text-3" id="text-6-2">

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="todo TODO"> TODO</span> red asterisks, allow to edit text lambdas in editor </h3>
<div class="outline-text-3" id="text-6-3">

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="todo TODO"> TODO</span> Come up with better scheme for spraying fractal terrain. </h3>
<div class="outline-text-3" id="text-6-4">

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="todo TODO"> TODO</span> Metamap: Allow really low and really high / required probability maps </h3>
<div class="outline-text-3" id="text-6-5">

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="todo TODO"> TODO</span> Use horizontal space in narration window to summarize encounter. </h3>
<div class="outline-text-3" id="text-6-6">

</div>

</div>
