notebook/rlx-todo.html

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="todo TODO"> TODO</span> Cells that prevent ships from entering. Ship checks for :vehicle-obstacle </h3>
<div class="outline-text-3" id="text-6-7">

</div>

</div>

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="todo TODO"> TODO</span> Synthesize :step events to all cells in a grid when you step </h3>
<div class="outline-text-3" id="text-6-8">

</div>

</div>

<div id="outline-container-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="todo TODO"> TODO</span> Hierarchical HUD: with back button </h3>
<div class="outline-text-3" id="text-6-9">

</div>

</div>

<div id="outline-container-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="todo TODO"> TODO</span> You shouldn't be able to see through the floor to the icy surface. </h3>
<div class="outline-text-3" id="text-6-10">

</div>

</div>

<div id="outline-container-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="todo TODO"> TODO</span> Properly move things out of containers </h3>
<div class="outline-text-3" id="text-6-11">

</div>

</div>

<div id="outline-container-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="todo TODO"> TODO</span> Fix narration getting into/out of vehicles </h3>
<div class="outline-text-3" id="text-6-12">

</div>

</div>

<div id="outline-container-6-13" class="outline-3">
<h3 id="sec-6-13"><span class="todo TODO"> TODO</span> Fix lines between tile rows when font is too big </h3>
<div class="outline-text-3" id="text-6-13">

</div>

</div>

<div id="outline-container-6-14" class="outline-3">
<h3 id="sec-6-14"><span class="todo TODO"> TODO</span> Read Braitenberg's "Vehicles" </h3>
<div class="outline-text-3" id="text-6-14">

</div>

</div>

<div id="outline-container-6-15" class="outline-3">
<h3 id="sec-6-15"><span class="todo TODO"> TODO</span> Make rlx-load-game use completing-read </h3>
<div class="outline-text-3" id="text-6-15">

</div>

</div>

<div id="outline-container-6-16" class="outline-3">
<h3 id="sec-6-16"><span class="todo TODO"> TODO</span> Implement formatted sensor values by returning more stuff in plist </h3>
<div class="outline-text-3" id="text-6-16">

</div>

</div>

<div id="outline-container-6-17" class="outline-3">
<h3 id="sec-6-17"><span class="todo TODO"> TODO</span> Implement cellular automata terrain </h3>
<div class="outline-text-3" id="text-6-17">

</div>

</div>

<div id="outline-container-6-18" class="outline-3">
<h3 id="sec-6-18"><span class="todo TODO"> TODO</span> Implement floating light sources </h3>
<div class="outline-text-3" id="text-6-18">

</div>

</div>

<div id="outline-container-6-19" class="outline-3">
<h3 id="sec-6-19"><span class="todo TODO"> TODO</span> Use make-progress-reporter </h3>
<div class="outline-text-3" id="text-6-19">

</div>

</div>

<div id="outline-container-6-20" class="outline-3">
<h3 id="sec-6-20"><span class="todo TODO"> TODO</span> Don't allow targeting of shadowed areas. </h3>
<div class="outline-text-3" id="text-6-20">

</div>

</div>

<div id="outline-container-6-21" class="outline-3">
<h3 id="sec-6-21"><span class="todo TODO"> TODO</span> Implement wiki backlink search (for categories etc.) </h3>
<div class="outline-text-3" id="text-6-21">

</div>

</div>

<div id="outline-container-6-22" class="outline-3">
<h3 id="sec-6-22"><span class="todo TODO"> TODO</span> Quickly navigate wiki: hotkey for front page ("/") and right-click to follow </h3>
<div class="outline-text-3" id="text-6-22">

</div>

</div>

<div id="outline-container-6-23" class="outline-3">
<h3 id="sec-6-23"><span class="todo TODO"> TODO</span> rlx-grid-paint-replace-all </h3>
<div class="outline-text-3" id="text-6-23">

</div>

</div>

<div id="outline-container-6-24" class="outline-3">
<h3 id="sec-6-24"><span class="todo TODO"> TODO</span> Combine the duplicated HUD move functions into one </h3>
<div class="outline-text-3" id="text-6-24">

</div>

</div>

<div id="outline-container-6-25" class="outline-3">
<h3 id="sec-6-25"><span class="todo TODO"> TODO</span> Write specifications for all events and use (let) to rename "to" and "from" </h3>
<div class="outline-text-3" id="text-6-25">

</div>

</div>

<div id="outline-container-6-26" class="outline-3">
<h3 id="sec-6-26"><span class="todo TODO"> TODO</span> Evaluate non-spec values in defcell </h3>
<div class="outline-text-3" id="text-6-26">

</div>

</div>

<div id="outline-container-6-27" class="outline-3">
<h3 id="sec-6-27"><span class="todo TODO"> TODO</span> Always return next-player from rlx-run-world? </h3>
<div class="outline-text-3" id="text-6-27">

</div>

</div>

<div id="outline-container-6-28" class="outline-3">
<h3 id="sec-6-28"><span class="todo TODO"> TODO</span> Make utility defsubsts for forwarding commands to self </h3>
<div class="outline-text-3" id="text-6-28">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">CellMode Tasks </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo TODO"> TODO</span> Use symbol-macrolet to bind instance vars in (cell-mode-define </h3>
<div class="outline-text-3" id="text-7-1">

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="todo TODO"> TODO</span> Add documentation to each section of cell.el </h3>
<div class="outline-text-3" id="text-7-2">

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="todo TODO"> TODO</span> Docstrings! </h3>
<div class="outline-text-3" id="text-7-3">

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="todo TODO"> TODO</span> Rename things for more consistent naming convention&hellip; make-cell-sheet </h3>
<div class="outline-text-3" id="text-7-4">

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="todo TODO"> TODO</span> Try to split it into three parts: UI, dataflow, wiki </h3>
<div class="outline-text-3" id="text-7-5">

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="todo TODO"> TODO</span> Elisp Cell: Don't blitz buffer when already open </h3>
<div class="outline-text-3" id="text-7-6">

</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="todo TODO"> TODO</span> Add buffer-undo-list progammable elements </h3>
<div class="outline-text-3" id="text-7-7">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Optimization </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-4">
<h4 id="sec-8-1"><span class="todo TODO"> TODO</span> Use macros to eliminate zillion funcalls in rlx-trace-* </h4>
<div class="outline-text-4" id="text-8-1">

</div>

</div>

<div id="outline-container-8-2" class="outline-4">
<h4 id="sec-8-2"><span class="todo TODO"> TODO</span> Don't cons so much during lighting process </h4>
<div class="outline-text-4" id="text-8-2">

</div>

</div>

<div id="outline-container-8-3" class="outline-4">
<h4 id="sec-8-3"><span class="todo TODO"> TODO</span> Use diagonal distance as heuristic in rlx-path </h4>
<div class="outline-text-4" id="text-8-3">

<ul>
<li>h(n) = D * max(abs(n.x-goal.x), abs(n.y-goal.y))
</li>
</ul>

</div>

</div>

<div id="outline-container-8-4" class="outline-4">
<h4 id="sec-8-4"><span class="done DONE"> DONE</span> Add heuristic tie-breaker in rlx-path </h4>
<div class="outline-text-4" id="text-8-4">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-28 Thu 05:03</span></span><br/>
</p><ul>
<li>h(n) *= (1.0 + p), example p=step<sub>cost</sub>/expected max path length
</li>
</ul>

</div>

</div>

<div id="outline-container-8-5" class="outline-4">
<h4 id="sec-8-5"><span class="todo TODO"> TODO</span> Don't call rlx-default-event for commands or :turn </h4>
<div class="outline-text-4" id="text-8-5">

</div>

</div>

<div id="outline-container-8-6" class="outline-4">
<h4 id="sec-8-6"><span class="done DONE"> DONE</span> Replace BLOCK by COND in defcell expansion </h4>
<div class="outline-text-4" id="text-8-6">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-14 Thu 07:43</span></span><br/>
</p></div>

</div>

<div id="outline-container-8-7" class="outline-4">
<h4 id="sec-8-7"><span class="done DONE"> DONE</span> Render tiles by replacing text properties </h4>
<div class="outline-text-4" id="text-8-7">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-11 Mon 08:18</span></span><br/>
</p></div>

</div>

<div id="outline-container-8-8" class="outline-4">
<h4 id="sec-8-8"><span class="todo TODO"> TODO</span> Make sure :tile and :event are at start of plists </h4>
<div class="outline-text-4" id="text-8-8">

</div>

</div>

<div id="outline-container-8-9" class="outline-4">
<h4 id="sec-8-9"><span class="todo TODO"> TODO</span> Don't send :turn to non :cpu/:player cells </h4>
<div class="outline-text-4" id="text-8-9">

</div>

</div>

<div id="outline-container-8-10" class="outline-4">
<h4 id="sec-8-10"><span class="todo TODO"> TODO</span> More defsubst </h4>
<div class="outline-text-4" id="text-8-10">

</div>

</div>

<div id="outline-container-8-11" class="outline-4">
<h4 id="sec-8-11"><span class="todo TODO"> TODO</span> Speed up cell-image-compute: don't use temp-buffer/insert-image </h4>
<div class="outline-text-4" id="text-8-11">

</div>

</div>

<div id="outline-container-8-12" class="outline-4">
<h4 id="sec-8-12"><span class="todo TODO"> TODO</span> (info "(elisp)Forcing Redisplay") </h4>
<div class="outline-text-4" id="text-8-12">

</div>

</div>

<div id="outline-container-8-13" class="outline-4">
<h4 id="sec-8-13"><span class="todo TODO"> TODO</span> Speed up rlx-invoke-event </h4>
<div class="outline-text-4" id="text-8-13">

</div>

</div>

<div id="outline-container-8-14" class="outline-4">
<h4 id="sec-8-14"><span class="todo TODO"> TODO</span> Profile and optimize cell-mode </h4>
<div class="outline-text-4" id="text-8-14">

</div>

</div>

<div id="outline-container-8-15" class="outline-4">
<h4 id="sec-8-15"><span class="todo TODO"> TODO</span> Don't use (append) in rlx-run-events </h4>
<div class="outline-text-4" id="text-8-15">

</div>

</div>

<div id="outline-container-8-16" class="outline-4">
<h4 id="sec-8-16"><span class="todo TODO"> TODO</span> Use integer math in (rlx-trace) </h4>
<div class="outline-text-4" id="text-8-16">

</div>

</div>

<div id="outline-container-8-17" class="outline-4">
<h4 id="sec-8-17"><span class="done DONE"> DONE</span> Don't narrate enemy turns </h4>
<div class="outline-text-4" id="text-8-17">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-08 Fri 11:38</span></span><br/>
</p></div>

</div>

<div id="outline-container-8-18" class="outline-4">
<h4 id="sec-8-18"><span class="done DONE"> DONE</span> Turn off undo information in rlx-mode buffre </h4>
<div class="outline-text-4" id="text-8-18">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-06 Wed 23:20</span></span><br/>
</p></div>

</div>

<div id="outline-container-8-19" class="outline-4">
<h4 id="sec-8-19"><span class="done DONE"> DONE</span> Don't use (rlx-grid-get) in (rlx-grid-render) </h4>
<div class="outline-text-4" id="text-8-19">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-09-06 Wed 23:32</span></span><br/>
</p>
<p>
This looks up the same row every time&hellip; instead i should try mapc or
something, loading each row just once.
</p>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="todo TODO"> TODO</span> Documentation </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="todo TODO"> TODO</span> Examples of prototype at prototype section </h3>
<div class="outline-text-3" id="text-9-1">

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="todo TODO"> TODO</span> Examples of each cell type </h3>
<div class="outline-text-3" id="text-9-2">

</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="todo TODO"> TODO</span> Explain default events better </h3>
<div class="outline-text-3" id="text-9-3">


</div>
</div>

</div>
